<a href="https://colab.research.google.com/github/lakshaynarula08/Open-Source-Software-Lab/blob/main/9918103075_OSS_LAB_ASSIGNMENT_7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import numpy as np
import pandas as pd

In [16]:
from google.colab import files
upload=files.upload()

Saving Automobile_data.csv to Automobile_data.csv

In [17]:
import pandas as pd
import numpy as np

In [21]:
x=pd.read_csv('Automobile_data.csv')
x.head(5)

   index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0
3      3         audi        sedan  ...         102               24  13950.0
4      4         audi        sedan  ...         115               18  17450.0

[5 rows x 10 columns]

In [23]:
x.tail(5)

    index     company body-style  ...  horsepower  average-mileage    price
56     81  volkswagen      sedan  ...          85               27   7975.0
57     82  volkswagen      sedan  ...          52               37   7995.0
58     86  volkswagen      sedan  ...         100               26   9995.0
59     87       volvo      sedan  ...         114               23  12940.0
60     88       volvo      wagon  ...         114               23  13415.0

[5 rows x 10 columns]

In [24]:
x.isna().any()

index               False
company             False
body-style          False
wheel-base          False
length              False
engine-type         False
num-of-cylinders    False
horsepower          False
average-mileage     False
price                True
dtype: bool

In [26]:
x=x.replace('?',np.NaN)
x=x.replace('n.a.',np.NaN)

In [27]:
x[x['company']=="bmw"]

    index company body-style  ...  horsepower  average-mileage    price
7       9     bmw      sedan  ...         101               23  16430.0
8      10     bmw      sedan  ...         101               23  16925.0
9      11     bmw      sedan  ...         121               21  20970.0
10     13     bmw      sedan  ...         182               16  30760.0
11     14     bmw      sedan  ...         182               16  41315.0
12     15     bmw      sedan  ...         182               15  36880.0

[6 rows x 10 columns]

In [28]:
x.groupby(['company'])['price'].max()

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

In [30]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925, 71400]}
Car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182, 160]}

In [33]:
Car_Price=pd.DataFrame(Car_Price)
Car_Horsepower=pd.DataFrame(Car_Horsepower)

In [35]:
Car_Price

  Company   Price
0  Toyota   23845
1   Honda   17995
2     BMV  135925
3    Audi   71400

In [36]:
Car_Horsepower

  Company  horsepower
0  Toyota         141
1   Honda          80
2     BMV         182
3    Audi         160

In [37]:
Car_Price.join(Car_Horsepower,lsuffix='company',rsuffix='company')

  Companycompany   Price Companycompany  horsepower
0         Toyota   23845         Toyota         141
1          Honda   17995          Honda          80
2            BMV  135925            BMV         182
3           Audi   71400           Audi         160